УТ_для_edt/src/Catalogs/CRM_ВажностьКлиентов/CRM_ВажностьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВажностьКлиентов</name>
  <comment>Важность клиентов</comment>
  <predefined>
    <items>
      <name>ВажныйКлиентРегиональногоУровня</name>
      <description>Важный клиент регионального уровня</description>
    </items>
    <items>
      <name>ВажныйКлиентФедеральногоУровня</name>
      <description>Важный клиент федерального уровня</description>
    </items>
    <items>
      <name>ОбычныйКлиент</name>
      <description>Обычный клиент</description>
    </items>
    <items>
      <name>ОсобоВажныйКлиент</name>
      <description>Особо важный клиент</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ВажностьКлиентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура выполняет заполнение предопределенных элементов справочника.
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ОсобоВажныйКлиент.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 1;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ВажныйКлиентФедеральногоУровня.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 2;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ВажныйКлиентРегиональногоУровня.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 3;
	ЭлементСправочника.Записать();
	
	ЭлементСправочника = Справочники.CRM_ВажностьКлиентов.ОбычныйКлиент.ПолучитьОбъект();
	ЭлементСправочника.РеквизитДопУпорядочивания = 4;
	ЭлементСправочника.Записать();
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции

// Процедура - обработчик получения формы справочника.
//
// Параметры:
//	ВидФормы					- Строка	- Вид формы справочника.
//	Параметры					- Структура	- Параметры, переданные для формы.
//	ВыбраннаяФорма				- Строка	- Имя открываемой формы справочника.
//	ДополнительнаяИнформация	- Строка	- Дополнительная информация.
//	СтандартнаяОбработка		- Булево	- Признак стандартной обработки.
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				// Запрещаем редактировать предопределенный элемент.
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлемента";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаПолученияФормы()

#КонецОбласти
